"use client";

import { useState } from "react";

export default function Page() {
  const [selectedTab, setSelectedTab] = useState<number>(0);

  return (
    <div className="bg-green-50 min-h-screen p-3">
      <div className="max-w-3xl mx-auto flex flex-col gap-3">
        {/* Nav Bar */}
        <nav className="bg-white rounded-md flex gap-3 p-3 justify-between">
          <button
            onClick={() => setSelectedTab(0)}
            className={`hover:underline flex-1 underline-offset-4 cursor-pointer ${selectedTab === 0 ? `underline` : ""}`}
          >
            Благодать
          </button>
          <button
            onClick={() => setSelectedTab(1)}
            className={`hover:underline flex-1 underline-offset-4 cursor-pointer ${selectedTab === 1 ? `underline` : ""}`}
          >
            Любов
          </button>
          <button
            onClick={() => setSelectedTab(2)}
            className={`hover:underline flex-1 underline-offset-4 cursor-pointer ${selectedTab === 2 ? `underline` : ""}`}
          >
            Радість
          </button>
          <button
            onClick={() => setSelectedTab(3)}
            className={`hover:underline flex-1 underline-offset-4 cursor-pointer ${selectedTab === 3 ? `underline` : ""}`}
          >
            Мир
          </button>
          <button
            onClick={() => setSelectedTab(4)}
            className={`hover:underline flex-1 underline-offset-4 cursor-pointer ${selectedTab === 4 ? `underline` : ""}`}
          >
            Віра
          </button>
          <button
            onClick={() => setSelectedTab(5)}
            className={`hover:underline flex-1 underline-offset-4 cursor-pointer ${selectedTab === 5 ? `underline` : ""}`}
          >
            Надія
          </button>
          <button
            onClick={() => setSelectedTab(6)}
            className={`hover:underline flex-1 underline-offset-4 cursor-pointer ${selectedTab === 6 ? `underline` : ""}`}
          >
            Рай
          </button>
        </nav>

        {/* Main Content */}
        <main className="bg-white rounded-md p-3 flex flex-col gap-3">
          {selectedTab === 0 ? (
            <>
              <p>
                Бо спасені ви благодаттю через віру, а це не від вас, то дар
                Божий, не від діл, щоб ніхто не хвалився. (Ефесян 2:8-9)
              </p>
              <p>
                І сказав Він мені: Досить тобі Моєї благодаті, бо сила Моя
                здійснюється в немочі. Отож, краще я буду хвалитись своїми
                немочами, щоб сила Христова вселилася в мене. (2 Коринтян 12:9)
              </p>
              <p>
                А коли за благодаттю, то не з учинків, інакше благодать не була
                б благодаттю. А коли з учинків, то це більше не благодать,
                інакше вчинок не є вже вчинок. (Римлян 11:6)
              </p>
            </>
          ) : selectedTab === 1 ? (
            <>
              <p>
                Любов довготерпить, любов милосердствує, не заздрить, любов не
                величається, не надимається, не поводиться нечемно, не шукає
                тільки свого, не рветься до гніву, не думає лихого, не радіє з
                неправди, але тішиться правдою, усе зносить, вірить у все,
                сподівається всього, усе терпить! Ніколи любов не перестає! Хоч
                пророцтва й існують, та припиняться, хоч мови існують,
                замовкнуть, хоч існує знання, та скасується. (1 Коринтян 13:4-8)
              </p>
              <p>хай з любов`ю все робиться в вас! (1 Коринтян 16:14)</p>
              <p>
                Хто не любить, той Бога не пізнав, бо Бог є любов! (1 Івана 4:8)
              </p>
            </>
          ) : selectedTab === 2 ? (
            <>
              <p>
                Бог же надії нехай вас наповнить усякою радістю й миром у вірі,
                щоб ви збагатились надією, силою Духа Святого! (Римлян 15:13)
              </p>
              <p>
                тіштесь надією, утиски терпіть, перебувайте в молитві, (Римлян
                12:12)
              </p>
              <p>
                Радійте в Господі завсіди, і знову кажу: радійте! (Филип`ян 4:4)
              </p>
            </>
          ) : selectedTab === 3 ? (
            <>
              <p>
                Це Я вам розповів, щоб мали ви мир у Мені. Страждання зазнаєте в
                світі, але будьте відважні: Я світ переміг! (Івана 16:33)
              </p>
              <p>
                А Сам Господь миру нехай завжди дасть вам мир усяким способом.
                Господь з вами всіма! (2 Солунян 3:16)
              </p>
              <p>
                Зоставляю вам мир, мир Свій вам даю! Я даю вам не так, як дає
                світ. Серце ваше нехай не тривожиться, ані не лякається! (Івана
                14:27)
              </p>
            </>
          ) : selectedTab === 4 ? (
            <>
              <p>
                Догодити ж без віри не можна. І той, хто до Бога приходить,
                мусить вірувати, що Він є, а тим, хто шукає Його, Він дає
                нагороду. (Євреїв 11:6)
              </p>
              <p>
                І все, чого ви в молитві попросите з вірою, то одержите. (Матвія
                21:22)
              </p>
              <p>
                Тож віра від слухання, а слухання через Слово Христове. (Римлян
                10:17)
              </p>
            </>
          ) : selectedTab === 5 ? (
            <>
              <p>
                Бо Я знаю ті думки, які думаю про вас, говорить Господь, думки
                спокою, а не на зло, щоб дати вам будучність та надію. (Єремія
                29:11)
              </p>
              <p>
                а ті, хто надію складає на Господа, силу відновлять, крила
                підіймуть, немов ті орли, будуть бігати і не потомляться, будуть
                ходити і не помучаться! (Ісая 40:31)
              </p>
              <p>
                А віра то підстава сподіваного, доказ небаченого. (Євреїв 11:1)
              </p>
            </>
          ) : selectedTab === 6 ? (
            <>
              <p>
                Багато осель у домі Мого Отця; а коли б то не так, то сказав би
                Я вам, що йду приготувати місце для вас? (Івана 14:2)
              </p>
              <p>
                і Бог кожну сльозу з очей їхніх зітре, і не буде вже смерти. Ані
                смутку, ані крику, ані болю вже не буде, бо перше минулося!
                (Об`явлення 21:4)
              </p>
              <p>
                Але, як написано: Чого око не бачило й вухо не чуло, і що на
                серце людині не впало, те Бог приготував був тим, хто любить
                Його! (1 Коринтян 2:9)
              </p>
            </>
          ) : (
            <></>
          )}
        </main>
      </div>
    </div>
  );
}
